Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/civil_law/small_claims_and_a_court_hearing.html.txt.tmx
Source language: en
Languages: ga

source: Small claims and a court hearing
ga: Éilimh bheaga agus éisteacht chúirte

source: If your small claims procedure case could not be resolved and has been referred for a hearing in the District Court, you will receive a letter from the District Court office telling you the date and time of the court hearing and the location of the court itself
ga: Murarbh fhéidir do chás um nós imeachta i leith éileamh beag a réiteach agus gur atreoraíodh é i gcomhair éisteachta sa Chúirt Dúiche, is amhlaidh a gheobhaidh tú litir ó oifig na Cúirte Dúiche ag insint duit dáta agus tráth na héisteachta cúirte agus suíomh na cúirte féin

source: The case will be heard in public as part of a normal sitting of the District Court
ga: Éistfear go poiblí an cás mar chuid de ghnáthshuí na Cúirte Dúiche

source: If you have any difficulty with attending court on the date set for the hearing, notify the District Court office and the respondent immediately
ga: Má bhaineann aon deacracht duit le freastal ar an gcúirt ag an dáta a socraíodh don éisteacht, cuir fógra chuig oifig na Cúirte Dúiche agus chuig an bhfreagróir láithreach bonn

source: You may ask to have the date adjourned, or put back, to another date
ga: Is féidir leat iarraidh ar an gcúirt chun an dáta a chur ar athló, nó a chur ar aghaidh chuig dáta éigin eile

source: Only the judge can make this order and you will need a very good reason for not being able to attend or go ahead with the case on that date
ga: Is iad an breitheamh amháin ar féidir leo an t-ordú sin a thabhairt agus teastóidh cúis fhíormhaith uait gan bheith in ann freastal ná dul ar aghaidh ar/leis an gcás an dáta úd

source: If you cannot attend yourself, you can send a representative to make the request to the court on your behalf
ga: Mura féidir leat féin freastal uirthi, is féidir leat ionadaí a chur chuici chun an t-iarratas a dhéanamh os comhair na cúirte ar do shonsa

source: It is very important to prepare yourself for the court hearing
ga: Tá sé fíorthábhachtach go n-ullmhaíonn tú tú féin don éisteacht chúirte

source: It may be advisable to get legal advice
ga: B’fhéidir gurbh inmholta é chun comhairle dhlíthiúil a fháil

source: Under Irish law, a business is required to be legally represented in court-based proceedings
ga: Ní foláir go mbeadh ionadaíocht dhlíthiúil ag gnólacht éigin de réir dhlí na hÉireann in imeachtaí na cúirte

source: If you are not familiar with the court process, you should familiarise yourself with the layout, court practice and operation of the court in advance of the hearing
ga: Mura bhfuil aithne agat ar an bpróiseas cúirte, ba cheart duit dul i dtaithí ar leagan amach, cleachtadh na cúirte agus feidhmiú na cúirte roimh an éisteacht

source: You will need to present information to the judge that sets out clearly the nature of your relationship with the respondent, that is, the person you are claiming against
ga: Caithfidh tú faisnéis a thabhairt don bhreitheamh ina leagtar amach go soiléir cineáil do chaidrimh leis an bhfreagróir, is é sin an duine a bhfuil tú ag éileamh ina gcoinne

source: This relationship could relate to the roles of:
ga: D’fhéadfadh an caidreamh sin bheith bainteach le róil mar:

source: • Consumer and service provider
ga: • Tomhaltóir agus soláthraí seirbhíse

source: • Owner of property the respondent has allegedly damaged
ga: • Úinéir na maoine a líomhnaítear go ndearna an freagróir damáiste di

source: You will need to show what went wrong and give the circumstances surrounding the problem
ga: Caithfidh tú na fabhtanna a léiriú agus na himthosca a thabhairt timpeall na faidhbe

source: You will need to show how you tried to put the matter right and the steps you took to remedy the situation
ga: Caithfidh tú léargas a thabhairt faoin gcaoi a ndearna tú iarracht cúrsaí a cheartú agus na céimeanna a ghlac tú chun an fhadhb a fhuascailt

source: You should also know how the various consumer laws protect you in your particular situation and draw the court's attention to them
ga: Ba chóir go mbeadh aithne agat freisin ar an gcaoi ina dtugann na dlíthe tomhaltóirí cosaint duit i do chúinsí faoi leith agus aird na cúirte a tharraingt dóibh

source: You can read more about consumer rights here
ga: Is féidir leat a thuilleadh a léamh faoi chearta tomhaltóirí anseo

source: You should be clear about exactly what it is you are claiming for
ga: Ba cheart go mbeifeá soiléir faoin méid beacht a bhfuil tú ag éileamh air

source: When presenting your information to the court, you should back it up with evidence wherever possible
ga: Ba chóir duit fianaise a thabhairt mar chruthúnas más féidir ar chor ar bith é nuair a chuireann tú d’eolas os comhair na cúirte

source: • Have your receipt or other proof of purchase ready
ga: • mbeadh d'admháil nó cruthúnas ceannaigh éigin eile réidh leat

source: • Bring the faulty or damaged goods to the court to show them to the judge
ga: • dtabharfá na hearraí fabhtacha nó damáistithe chun na cúirte lena dtaispeáint don bhreitheamh

source: • Take photographs of poor workmanship, damaged property or poor quality goods or services that you cannot bring to court
ga: • dtógfá grianghraif den drochshaoirseacht, den mhaoin dhamáistithe nó d'earraí nó seirbhísí droch-chaighdeáin nach féidir leat tabhairt chun na cúirte leat iad

source: • Get an independent opinion by another expert and have the expert appear in the court as your witness (you will be responsible for any expense this might incur)
ga: • bhfaighfeá tuairim neamhspleách ó shaineolaí éigin eile agus go dtiocfadh an saineolaí os comhair na cúirte mar d’fhinné (is tusa a bheidh freagrach as aon chaiteachas a d’fhéadfadh bheith bainteach leis sin)

source: • Bring any letters, advertisements or any other documents you may have relied on when buying the goods or services
ga: • dtabharfá litir, fógra nó cáipéis ar bith eile leat a ndeachaigh tú i dtuilleamaí orthu nuair a cheannaigh tú na hearraí nó na seirbhísí

source: • Ask any other person who can back up your claim, especially in the case of faulty services provided, to attend as a witness
ga: • n-iarrfá ar dhuine ar bith eile ar féidir leo tacú le d’éileamh, go háirithe i gcás seirbhís fabhtacha arna soláthar, chun freastal mar fhinné

source: You can send them a witness summons if necessary – the Small Claims Registrar can issue a witness summons on your behalf for a small fee
ga: Is féidir leat toghairm finné a sheoladh dóibh más gá – is féidir leis an gCláraitheoir um Éilimh Bheaga toghairm finné a eisiúint ar do shonsa ar tháille bheag

source: On the day of your court hearing, you will have to attend the District Court
ga: Caithfidh tú freastal ar an gCúirt Dúiche lá d’éisteachta cúirte

source: It will be a court open to the public and it will be a District Court judge that will hear your case
ga: Is cúirt oscailte don phobal a bheidh inti, agus is breitheamh na Cúirte Dúiche a éistfidh le do chás

source: When your case is called you will hear your name called out and then the name of the respondent, for example, "Patrick Murphy versus Joe Ryan"
ga: Cloisfidh tú d’ainm á ghlaoch os ard agus ainm an fhreagróra ina dhiaidh nuair a ghairtear do chás, mar shampla, "Patrick Murphy i gcoinne Joe Ryan"

source: At this point, you should stand up and identify yourself to the court
ga: Ba chóir duit éirí i do sheasamh ag an tráth sin agus tú féin a chur in aithne don chúirt

source: The Small Claims Registrar will then call out to the judge a summary of what your case is about
ga: Glaofaidh An Cláraitheoir um Éilimh Bheaga achoimre faoina mbaineann le do chás don bhreitheamh ansin

source: You will be asked to go to the witness box
ga: Iarrfar orthu chun dul isteach i gclár na mionn

source: You will stand in the witness box and the Court Clerk will assist you to swear an oath or to make an affirmation to tell the truth
ga: Fanfaidh tú i do sheasamh i gclár na mionn agus tabharfaidh Cléireach na Cúirte cúnamh duit chun mionn a ghlacadh nó chun dearbhú a thabhairt chun an fhírinne a insint

source: The judge will then ask you to begin your case
ga: Iarrfaidh an breitheamh ort ansin chun do chás a thosú

source: Here is where you must give your side of the dispute, in as clear a fashion as possible and backed up with as much evidence as you need
ga: Is sa tráth sin nach foláir duit do dhearcadh i leith na díospóide a thabhairt, chomh soiléir agus is féidir agus le tacaíocht ón oiread fianaise agus a theastaíonn uait

source: The judge will ask you some questions, which you should answer as best you can
ga: Cuirfidh an breitheamh roinnt ceisteanna ort, ar chóir duit iad a fhreagairt chomh maith agus arbh fhéidir leat

source: Remember, the correct way to address the judge is "judge" and you should direct your answers to the judge at all times
ga: Meabhraigh gurb é an beannú ceart do bhreitheamh é “a bhreithimh”, agus go mba chóir duit d’fhreagraí a threorú ar an mbreitheamh i gcónaí

source: When you have answered the judge's questions, the judge will give the respondent an opportunity to question you
ga: Nuair a bheidh freagra tugtha agat do cheisteanna an bhreithimh, is amhlaidh a thabhairt an breitheamh deis don fhreagróir chun ceisteanna a chur ortsa

source: Answer these questions as best you can but do not start an argument with the respondent
ga: Freagair na ceisteanna úd ar feadh d’eolais, ach ná cuir tús le hargóint leis an bhfreagróir

source: After this, you will be allowed to leave the witness box
ga: Ligfear duit clár na mionn a fhágáil dá éis sin

source: If you wish to call a witness, you should do so at this time
ga: Más mian leat finné a ghlaoch, ba cheart duit é sin a dhéanamh ag an tráth úd

source: Your witness will go through a similar procedure
ga: Rachaidh d’fhinné trí nós imeachta comhchosúil

source: When your witness or witnesses have finished, it will be the respondent's turn to give their evidence
ga: Tiocfaidh seal an fhreagróra dá bhfianaise nuair a bheidh d'fhinné nó finnéithe críochnaithe

source: If your case is against a company, a representative of the company will speak on its behalf
ga: Más i gcoinne comhlachta é do chás, is amhlaidh a labhróidh ionadaí an chomhlachta ar a shonsan

source: The procedure for the respondent is very much the same as it was for you
ga: Is beagnach mar a chéile é an nós imeachta don fhreagróir agus an nós imeachta duit féin

source: You will get an opportunity to question the respondent when the judge has finished asking them questions
ga: Gheobhaidh tú deis chun ceisteanna a chur ar an bhfreagróir nuair a bheidh an breitheamh críochnaithe lena gceistiú

source: You can prepare for this by studying the respondent's reply on the Notice of Dispute (and Counterclaim, if relevant) and by preparing questions in advance
ga: Is féidir leat ullmhú dó sin ach staidéar a dhéanamh ar fhreagra an fhreagróra don Fhógra Díospóide (agus sa Fhrithéileamh más ábhartha é) agus trí cheisteanna a ullmhú roimh ré

source: You will also need to listen carefully to what the respondent says while in the witness box and you can challenge any evidence you do not agree with at this time
ga: Beidh ort freisin éisteacht go cúramach lena bhfuil le rá ag an bhfreagróir agus iad i gclár na mionn, agus is féidir leat dúshlán a thabhairt in aghaidh fianaise ar bith nach n-aontaíonn léi ag an tráth sin

source: The respondent will then have an opportunity to call witnesses to give evidence
ga: Beidh deis ag an bhfreagróir ansin chun finnéithe a ghlaoch chun fianaise a thabhairt

source: You will also be given an opportunity to put questions to these witnesses
ga: Tabharfar deis duit freisin chun ceisteanna a chur ar na finnéithe úd

source: When all the witnesses have been heard, the judge will usually make their decision there and then
ga: Is iondúil go ndéanfaidh an breitheamh a gcinneadh ar an toirt nuair a bheifear tar éis éisteacht le gach finné

source: If the judge decides in your favour, they will make an order or decree
ga: Tabharfaidh an breitheamh ordú nó foraithne má thagann siad ar chinneadh i d'fhabhar

source: This is usually an order for the respondent to pay an amount of money to you, but the judge can decide to make any order they see fit
ga: Is iondúil gurb ordú atá anseo chun is go n-íocfaidh an freagróir suim airgid leat, ach is féidir leis an mbreitheamh cinneadh a dhéanamh chun aon ordú a mheasann siad bheith cuí a thabhairt

source: For example, the judge may direct that the work be completed or the goods be repaired
ga: Mar shampla, is féidir leis an mbreitheamh treoir a thabhairt go gcríochnaítear an saothar nó go ndeisítear na hearraí

source: The order will be made to suit your particular case
ga: Ceapfar an t-ordú chun bheith oiriúnach don chás faoi leith agat

source: If the court makes a decree for an amount of money, the respondent has 28 calendar days to pay you
ga: Má cheapann an chúirt foraithne i gcomhair suim airgid, is amhlaidh a bheidh 28 lá de réir an fhéilire ag an bhfreagróir chun tú a íoc

source: If the court makes any other type of decree, it will usually put a time limit within which it must be completed
ga: Má cheapann an chúirt cineál foraithne éigin eile, is iondúil go gcuirfear teorainn ama nach foláir di bheith críochnaithe laistigh di

source: If the judge decides not to uphold your claim, your case will be dismissed
ga: Má chinneann an breitheamh gan seasamh le d’éileamh, is amhlaidh a dhíbhfear do chás

source: This means that no order or decree will be made in your favour
ga: Ciallaíonn sé sin nach ndéanfar ordú ná foraithne ar bith i d’fhabhar

source: You can find further information on the District Court hearing on the Courts Service website
ga: Is féidir leat teacht ar a thuilleadh eolais i leith éisteacht na Cúirte Dúiche ar láithreán gréasáin na Seirbhíse Cúirteanna
